#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ,Режим)
	
	// Реализуйте проверку при проведении документа, что выбран договор с типом 
	// абонентская плата и что дата документа лежит между датой начала и датой 
	// окончания действия договора
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачало КАК ДатаНачало,
	|	ДоговорыКонтрагентов.ВКМ_ДатаКонец КАК ДатаКонец,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧаса КАК СтоимостьЧаса,
	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту * ВТ.СтоимостьЧаса) КАК Сумма,
	|	ВТ.ДатаНачало КАК ДатаНачало,
	|	ВТ.ДатаКонец КАК ДатаКонец,
	|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|		ПО ВТ.Ссылка = ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ДатаНачало,
	|	ВТ.ДатаКонец,
	|	ВТ.ДатаПроведенияРабот";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Результат.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю();
		ТекстСообщениея = "Не корректный вид договора.";
		Сообщение.Текст = ТекстСообщениея;
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ДатаНачало > Дата ИЛИ Выборка.ДатаКонец < Дата Тогда
			Сообщение = Новый СообщениеПользователю();
			ТекстСообщениея = "Не корректная дата документа.";
			Сообщение.Текст = ТекстСообщениея;
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Выборка.Сумма;
	КонецЦикла;   
	
	// регистр ВКМ_ВыполненныеСотрудникомРаботы Расход
	Процент = ПолучитьПроцент();
	
	Если Процент = Неопределено Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для специалиста " + Специалист + " на дату " + Формат(Дата, "ДФ=dd.MM.yyyy") + " не установлен процент оплаты.");
		Возврат;
	КонецЕсли; 
	
	СтавкаЧасаКлиента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СтоимостьЧасаРаботы");
	
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Для Каждого ТекСтрокаВыполненныеРаботы Из ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту * СтавкаЧасаКлиента * Процент / 100;
	КонецЦикла;
	
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вставить содержимое обработчика. 
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "";
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		
		Спр_ВКМ_УведомленияТГБот = Справочники.ВКМ_УведомленияТГБот.СоздатьЭлемент();
		
		ТекстСообщения = СтрШаблон("Для специалиста %1 новая заявка: %2", 
						Специалист, ОписаниеПроблемы);
		Спр_ВКМ_УведомленияТГБот.ТекстСообщения = ТекстСообщения;
		Спр_ВКМ_УведомленияТГБот.Записать();
		
	Иначе 

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
			|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
			|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан КАК ВремяОкончанияРаботПлан,
			|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
			|	ВКМ_ОбслуживаниеКлиента.Номер КАК Номер,
			|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
			|	И (ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот <> &ДатаПроведенияРабот
			|			ИЛИ ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан <> &ВремяНачалаРаботПлан
			|			ИЛИ ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан <> &ВремяОкончанияРаботПлан
			|			ИЛИ ВКМ_ОбслуживаниеКлиента.Специалист <> &Специалист)";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ДатаПроведенияРабот", ДатаПроведенияРабот);
		Запрос.УстановитьПараметр("ВремяНачалаРаботПлан", ВремяНачалаРабот);
		Запрос.УстановитьПараметр("ВремяОкончанияРаботПлан", ВремяОкончанияРабот);
		Запрос.УстановитьПараметр("Специалист", Специалист);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = СтрШаблон("В заявке № %1 от %2", Выборка.Номер, Выборка.Дата);
			
			Если Выборка.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
				
				ТекстСообщения = ТекстСообщения + Символы.ПС + 
				СтрШаблон("изменена дата проведения работ с %1 на %2", 
				Выборка.ДатаПроведенияРабот,
				ДатаПроведенияРабот);
				
			КонецЕсли;
			
			Если Выборка.Специалист <> Специалист Тогда
				
				ТекстСообщения = ТекстСообщения + Символы.ПС + 
				СтрШаблон("изменен специалист с %1 на %2", 
				Выборка.Специалист,
				Специалист);
				
			КонецЕсли;
			
			Если Выборка.ВремяНачалаРаботПлан <> ВремяНачалаРабот Тогда
				
				ТекстСообщения = ТекстСообщения + Символы.ПС + 
				СтрШаблон("изменено время начала работ с %1 на %2", 
				Выборка.ВремяНачалаРаботПлан,
				ВремяНачалаРабот);
				
			КонецЕсли;
			
			Если Выборка.ВремяОкончанияРаботПлан <> ВремяОкончанияРабот Тогда 
				
				ТекстСообщения = ТекстСообщения + Символы.ПС + 
				СтрШаблон("изменено время окончания работ с %1 на %2", 
				Выборка.ВремяОкончанияРаботПлан,
				ВремяОкончанияРабот);
				
			КонецЕсли;
			
			Спр_ВКМ_УведомленияТГБот = Справочники.ВКМ_УведомленияТГБот.СоздатьЭлемент();
			Спр_ВКМ_УведомленияТГБот.Наименование = "Изменения в документе";
			Спр_ВКМ_УведомленияТГБот.ТекстСообщения = ТекстСообщения;
			Спр_ВКМ_УведомленияТГБот.Записать();
			
		КонецЦикла; 
		
	КонецЕсли;
КонецПроцедуры



#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПроцент()
    	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Дата",      Дата);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентОтРабот;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции


#КонецОбласти 

#КонецЕсли