
&НаКлиенте
Процедура Обновить(Команда)
	ПолучениеДанныхСпециалиста();
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ДатаПроведенияРабот", НачалоДня(Начало));
	ЗначенияЗаполнения.Вставить("ВремяНачалаРабот", Начало);
	ЗначенияЗаполнения.Вставить("ВремяОкончанияРабот", Конец);
	ЗначенияЗаполнения.Вставить("Специалист", Специалист);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.Форма.ФормаДокумента", ПараметрыФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	ПолучениеДанныхСпециалиста();
КонецПроцедуры

Процедура ПолучениеДанныхСпециалиста()
	
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	Планировщик.Элементы.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот КАК ВремяНачалаРабот,
	|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
	|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка,
	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК ЛюбимыйКлиент
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Дата >= &НачалоПериода
	|	И ВКМ_ОбслуживаниеКлиента.Дата <= &КонецПериода
	|	И ВКМ_ОбслуживаниеКлиента.Специалист = &Специалист";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Специалист", Специалист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВремяНачалаРабот = Выборка.ДатаПроведенияРабот + (Выборка.ВремяНачалаРабот - Дата(1,1,1));
		ВремяКонцаРабот = Выборка.ДатаПроведенияРабот + (Выборка.ВремяОкончанияРабот - Дата(1,1,1));
		
		ЭлементПланировщика = Планировщик.Элементы.Добавить(ВремяНачалаРабот, ВремяКонцаРабот);
		ЭлементПланировщика.Значение = Выборка.Ссылка;
		ЭлементПланировщика.Текст = Выборка.ЛюбимыйКлиент;
		
	КонецЦикла;
			
КонецПроцедуры
